[Killed] ConditionalExpression
lib/numbers/basic.js:32:21
 basic.sum = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = 0;
-    for (var i = 0; i < arr.length; i++) {
+    for (var i = 0; false; i++) {
       if (typeof (arr[i]) === 'number') {
         total = total + arr[i];
killedBy: numbers sum should return the sum of items in an array
statusReason: 0 == 6

[Killed] EqualityOperator
lib/numbers/basic.js:33:11
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = 0;
     for (var i = 0; i < arr.length; i++) {
-      if (typeof (arr[i]) === 'number') {
+      if (typeof arr[i] !== 'number') {
         total = total + arr[i];
       } else {
killedBy: numbers sum should return the sum of items in an array
statusReason: All elements in array must be numbers

[Killed] EqualityOperator
lib/numbers/basic.js:54:7
  * @return {Number} difference.
  */
 basic.subtraction = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (Object.prototype.toString.call(arr) !== '[object Array]') {
     var total = arr[0];
     if (typeof (total) !== 'number') {
killedBy: numbers subtraction should return the difference of items in an array
statusReason: Input must be of type Array

[Killed] EqualityOperator
lib/numbers/basic.js:59:42
     if (typeof (total) !== 'number') {
       throw new Error('All elements in array must be numbers');
     }
-    for (var i = 1, length = arr.length; i < length; i++) {
+    for (var i = 1, length = arr.length; i <= length; i++) {
       if (typeof (arr[i]) === 'number') {
         total -= arr[i];
killedBy: numbers subtraction should return the difference of items in an array
statusReason: All elements in array must be numbers

[Killed] ConditionalExpression
lib/numbers/basic.js:79:7
  * @return {Number} product.
  */
 basic.product = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (false) {
     var total = arr[0];
     if (typeof (total) !== 'number') {
killedBy: numbers product should return the product of items in an array
statusReason: Input must be of type Array

[Killed] EqualityOperator
lib/numbers/basic.js:79:7
  * @return {Number} product.
  */
 basic.product = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (Object.prototype.toString.call(arr) !== '[object Array]') {
     var total = arr[0];
     if (typeof (total) !== 'number') {
killedBy: numbers product should return the product of items in an array
statusReason: Input must be of type Array

[Killed] ConditionalExpression
lib/numbers/basic.js:81:9
 basic.product = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = arr[0];
-    if (typeof (total) !== 'number') {
+    if (false) {
       throw new Error('All elements in array must be numbers');
     }
killedBy: numbers product should throw an exception when given anything objects other than numbers
statusReason: Missing expected exception.

[Killed] ConditionalExpression
lib/numbers/basic.js:85:11
       throw new Error('All elements in array must be numbers');
     }
     for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
+      if (true) {
         total = total * arr[i];
       } else {
killedBy: numbers product should throw an exception when given anything objects other than numbers
statusReason: Missing expected exception.

[Killed] ConditionalExpression
lib/numbers/basic.js:104:7
  * @return {Number} square of number
  */
 basic.square = function (num) {
-  if (typeof (num) !== 'number') {
+  if (true) {
     throw new Error('Input must be a number.');
   } else {
killedBy: numbers square should return the square of a number
statusReason: Input must be a number.

[Survived] ArrayDeclaration
lib/numbers/basic.js:121:13
  */
 basic.binomial = function (n, k) {
 
-  var arr = [];
+  var arr = ["Stryker was here"];
 
   function _binomial(n, k) {

[Killed] EqualityOperator
lib/numbers/basic.js:124:9
   var arr = [];
 
   function _binomial(n, k) {
-    if (typeof (n) !== 'number' && typeof (k) !== 'number') {
+    if (typeof n === 'number' && typeof (k) !== 'number') {
       throw new Error('Input must be a number.');
     }
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: The input did not match the regular expression /Input must be a number/. Input:

'RangeError: Maximum call stack size exceeded'

[Killed] EqualityOperator
lib/numbers/basic.js:124:36
   var arr = [];
 
   function _binomial(n, k) {
-    if (typeof (n) !== 'number' && typeof (k) !== 'number') {
+    if (typeof (n) !== 'number' && typeof k === 'number') {
       throw new Error('Input must be a number.');
     }
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: The input did not match the regular expression /Input must be a number/. Input:

'RangeError: Maximum call stack size exceeded'

[Killed] EqualityOperator
lib/numbers/basic.js:127:9
     if (typeof (n) !== 'number' && typeof (k) !== 'number') {
       throw new Error('Input must be a number.');
     }
-    if (n >= 0 && k === 0) return 1;
+    if (n > 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Maximum call stack size exceeded

[Killed] EqualityOperator
lib/numbers/basic.js:127:9
     if (typeof (n) !== 'number' && typeof (k) !== 'number') {
       throw new Error('Input must be a number.');
     }
-    if (n >= 0 && k === 0) return 1;
+    if (n < 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
lib/numbers/basic.js:128:9
       throw new Error('Input must be a number.');
     }
     if (n >= 0 && k === 0) return 1;
-    if (n === 0 && k > 0) return 0;
+    if (false) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
lib/numbers/basic.js:128:9
       throw new Error('Input must be a number.');
     }
     if (n >= 0 && k === 0) return 1;
-    if (n === 0 && k > 0) return 0;
+    if (true) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: 0 == 10

[Killed] ArithmeticOperator
lib/numbers/basic.js:132:17
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
 
-    arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
+    arr[n][k] = _binomial(n - 1, k - 1) - _binomial(n - 1, k);
     return arr[n][k];
   }
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: 4 == 10

[Killed] EqualityOperator
lib/numbers/basic.js:146:7
  * @return {Number} result.
  */
 basic.factorial = function (num) {
-  if (typeof (num) !== 'number') throw new Error("Input must be a number.");
+  if (typeof num === 'number') throw new Error("Input must be a number.");
   if (num < 0) throw new Error("Input must not be negative.");
   var i = 2,
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: Input must be a number.

[Killed] ConditionalExpression
lib/numbers/basic.js:170:7
   a = +a;
   b = +b;
   // Same as isNaN() but faster
-  if (a !== a || b !== b) {
+  if (true) {
     return NaN;
   }
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] EqualityOperator
lib/numbers/basic.js:170:7
   a = +a;
   b = +b;
   // Same as isNaN() but faster
-  if (a !== a || b !== b) {
+  if (a === a || b !== b) {
     return NaN;
   }
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] ConditionalExpression
lib/numbers/basic.js:174:62
     return NaN;
   }
   //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
+  if (a === Infinity || a === -Infinity || b === Infinity || false) {
     return Infinity;
   }
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: Can only operate on integers

[Killed] EqualityOperator
lib/numbers/basic.js:178:25
     return Infinity;
   }
   // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
+  if ((a % 1 !== 0) || (b % 1 === 0)) {
     throw new Error("Can only operate on integers");
   }
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: Can only operate on integers

[Killed] ConditionalExpression
lib/numbers/basic.js:186:11
     a = b;
     b = c;
   }
-  return (0 < a) ? a : -a;
+  return (false) ? a : -a;
 };
 
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: -1254 == 1254

[NoCoverage] ConditionalExpression
lib/numbers/basic.js:209:7
  * @return {Array} random elements.
  */
 basic.random = function (arr, quant, allowDuplicates) {
-  if (arr.length === 0) {
+  if (false) {
     throw new Error('Empty array');
   } else if (quant > arr.length && !allowDuplicates) {

[NoCoverage] StringLiteral
lib/numbers/basic.js:210:21
  */
 basic.random = function (arr, quant, allowDuplicates) {
   if (arr.length === 0) {
-    throw new Error('Empty array');
+    throw new Error("");
   } else if (quant > arr.length && !allowDuplicates) {
     throw new Error('Quantity requested exceeds size of array');

[NoCoverage] ConditionalExpression
lib/numbers/basic.js:211:14
 basic.random = function (arr, quant, allowDuplicates) {
   if (arr.length === 0) {
     throw new Error('Empty array');
-  } else if (quant > arr.length && !allowDuplicates) {
+  } else if (true && !allowDuplicates) {
     throw new Error('Quantity requested exceeds size of array');
   }

[NoCoverage] EqualityOperator
lib/numbers/basic.js:218:17
   if (allowDuplicates === true) {
     var result = [],
       i;
-    for (i = 0; i < quant; i++) {
+    for (i = 0; i <= quant; i++) {
       result[i] = arr[Math.floor(Math.random() * arr.length)];
     }

[NoCoverage] ConditionalExpression
lib/numbers/basic.js:218:17
   if (allowDuplicates === true) {
     var result = [],
       i;
-    for (i = 0; i < quant; i++) {
+    for (i = 0; false; i++) {
       result[i] = arr[Math.floor(Math.random() * arr.length)];
     }

[NoCoverage] MethodExpression
lib/numbers/basic.js:223:12
     }
     return result;
   } else {
-    return basic.shuffle(arr).slice(0, quant);
+    return basic.shuffle(arr);
   }
 };

[Killed] BooleanLiteral
lib/numbers/basic.js:255:7
  * @return {Number} maximum value in the array.
  */
 basic.max = function (arr) {
-  if (!Array.isArray(arr)) {
+  if (Array.isArray(arr)) {
     throw new Error("Input must be of type Array");
   }
killedBy: numbers basic.max will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] StringLiteral
lib/numbers/basic.js:256:21
  */
 basic.max = function (arr) {
   if (!Array.isArray(arr)) {
-    throw new Error("Input must be of type Array");
+    throw new Error("");
   }
   var max = -Infinity,
killedBy: numbers basic.max will throw an exception if argument is not an array.
statusReason: The input did not match the regular expression /Input must be of type Array/. Input:

'Error'

[Killed] ConditionalExpression
lib/numbers/basic.js:262:9
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
     val = +arr[i];
-    if (max < val) {
+    if (false) {
       max = val;
     }
killedBy: numbers max should return the biggest number in an array
statusReason: -Infinity == 42

[Killed] ConditionalExpression
lib/numbers/basic.js:280:7
  * @return {Number} minimum value in the array.
  */
 basic.min = function (arr) {
-  if (!Array.isArray(arr)) {
+  if (false) {
     throw new Error("Input must be of type Array");
   }
killedBy: numbers basic.min will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] ConditionalExpression
lib/numbers/basic.js:287:9
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
     val = +arr[i];
-    if (val < min) {
+    if (true) {
       min = val;
     }
killedBy: numbers min should return the smallest number in an array
statusReason: 42 == 1

[Killed] ConditionalExpression
lib/numbers/basic.js:315:10
     start = 0;
   }
 
-  step = step || 1;
+  step = true;
 
   if (stop < start) {
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  1,
  2,
  3,
  4,
  5

[Killed] ConditionalExpression
lib/numbers/basic.js:317:7
 
   step = step || 1;
 
-  if (stop < start) {
+  if (false) {
     step = 0 - Math.abs(step);
   }
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[]

should loosely deep-equal

[
  10,

[Killed] ConditionalExpression
lib/numbers/basic.js:317:7
 
   step = step || 1;
 
-  if (stop < start) {
+  if (true) {
     step = 0 - Math.abs(step);
   }
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[]

should loosely deep-equal

[
  1,

[Killed] ArithmeticOperator
lib/numbers/basic.js:321:28
     step = 0 - Math.abs(step);
   }
 
-  len = Math.max(Math.ceil((stop - start) / step) + 1, 0);
+  len = Math.max(Math.ceil((stop - start) * step) + 1, 0);
 
   array = new Array(len);
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  1,
  1.5,
  2
]

[Survived] ArrayDeclaration
lib/numbers/basic.js:323:11
 
   len = Math.max(Math.ceil((stop - start) / step) + 1, 0);
 
-  array = new Array(len);
+  array = new Array();
 
   while (i < len) {

[Killed] EqualityOperator
lib/numbers/basic.js:325:10
 
   array = new Array(len);
 
-  while (i < len) {
+  while (i >= len) {
     array[i++] = start;
     start += step;
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  <10 empty items>
]

should loosely deep-equal

[Killed] ArithmeticOperator
lib/numbers/basic.js:340:10
  * @return {Boolean} true for int, false for not int.
  */
 basic.isInt = function (n) {
-  return n % 1 === 0;
+  return n * 1 === 0;
 };
 
killedBy: numbers isInt checks for an integer
statusReason: false == true

[Killed] ConditionalExpression
lib/numbers/basic.js:340:10
  * @return {Boolean} true for int, false for not int.
  */
 basic.isInt = function (n) {
-  return n % 1 === 0;
+  return false;
 };
 
killedBy: numbers isInt checks for an integer
statusReason: false == true

[Killed] EqualityOperator
lib/numbers/basic.js:368:7
  * @return {Number} see the above documentation for return values.
  */
 basic.powerMod = function (a, b, m) {
-  if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
+  if (typeof a === 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: Inputs must be numbers.

[Killed] ConditionalExpression
lib/numbers/basic.js:368:7
  * @return {Number} see the above documentation for return values.
  */
 basic.powerMod = function (a, b, m) {
-  if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
+  if (true) throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: Inputs must be numbers.

[Killed] ConditionalExpression
lib/numbers/basic.js:372:7
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
   if (b === 0) return 1 % m;
-  if (b >= 1) {
+  if (true) {
     var result = 1;
     while (b > 0) {
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 6

[Killed] EqualityOperator
lib/numbers/basic.js:375:11
   if (b >= 1) {
     var result = 1;
     while (b > 0) {
-      if ((b % 2) === 1) {
+      if (b % 2 !== 1) {
         result = (result * a) % m;
       }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 2 == 1

[Timeout] ConditionalExpression
lib/numbers/basic.js:385:7
     return result;
   }
 
-  if (b === -1) return basic.modInverse(a, m);
+  if (false) return basic.modInverse(a, m);
   if (b < 1) {
     return basic.powerMod(a, Math.pow(b, -1), m);

[Killed] EqualityOperator
lib/numbers/basic.js:386:7
   }
 
   if (b === -1) return basic.modInverse(a, m);
-  if (b < 1) {
+  if (b >= 1) {
     return basic.powerMod(a, Math.pow(b, -1), m);
   }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: undefined == 6

[Killed] LogicalOperator
lib/numbers/basic.js:402:7
   a = +a;
   b = +b;
   // Same as isNaN() but faster
-  if (a !== a || b !== b) {
+  if (a !== a && b !== b) {
     return [NaN, NaN, NaN];
   }
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Can only operate on integers

[Killed] EqualityOperator
lib/numbers/basic.js:406:44
     return [NaN, NaN, NaN];
   }
   //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
+  if (a === Infinity || a === -Infinity || b !== Infinity || b === -Infinity) {
     return [Infinity, Infinity, Infinity];
   }
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] LogicalOperator
lib/numbers/basic.js:410:7
     return [Infinity, Infinity, Infinity];
   }
   // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
+  if (a % 1 !== 0 && b % 1 !== 0) {
     throw new Error("Can only operate on integers");
   }
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] UnaryOperator
lib/numbers/basic.js:413:25
   if ((a % 1 !== 0) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
-  var signX = (a < 0) ? -1 : 1,
+  var signX = (a < 0) ? +1 : 1,
     signY = (b < 0) ? -1 : 1,
     x = 0,
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  2,
  1,
  -0
]

[Killed] ConditionalExpression
lib/numbers/basic.js:446:7
  */
 basic.modInverse = function (a, m) {
   var r = basic.egcd(a, m);
-  if (r[0] !== 1) throw new Error('No modular inverse exists');
+  if (true) throw new Error('No modular inverse exists');
   return r[1] % m;
 };
killedBy: numbers modInverse will return the modulo m inverse of a
statusReason: No modular inverse exists

[Killed] ConditionalExpression
lib/numbers/basic.js:459:7
  * @param {Number} epsilon.
  */
 basic.numbersEqual = function (first, second, epsilon) {
-  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
+  if (true) throw new Error("First and Second must be numbers.");
   return (first - second) < epsilon && (first - second) > -epsilon;
 };
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: First and Second must be numbers.

[Killed] EqualityOperator
lib/numbers/basic.js:459:70
  * @param {Number} epsilon.
  */
 basic.numbersEqual = function (first, second, epsilon) {
-  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
+  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof epsilon === 'number') throw new Error("First and Second must be numbers.");
   return (first - second) < epsilon && (first - second) > -epsilon;
 };
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: First and Second must be numbers.

[Killed] ConditionalExpression
lib/numbers/basic.js:460:10
  */
 basic.numbersEqual = function (first, second, epsilon) {
   if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
-  return (first - second) < epsilon && (first - second) > -epsilon;
+  return true;
 };
 
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: true == false

[Killed] ConditionalExpression
lib/numbers/basic.js:460:40
  */
 basic.numbersEqual = function (first, second, epsilon) {
   if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
-  return (first - second) < epsilon && (first - second) > -epsilon;
+  return (first - second) < epsilon && true;
 };
 
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: true == false

[NoCoverage] StringLiteral
lib/numbers/basic.js:503:21
     throw new Error("n cannot be less than or equal to 0.");
   }
   if (n < k) {
-    throw new Error("k cannot be greater than k.");
+    throw new Error("");
   }
   var binomial = basic.binomial(n, k);
